---
title: Field
classe: Autodesk.Revit.DB.ExtensibleStorage.Field
namespace: Autodesk.Revit.DB.ExtensibleStorage
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 14
---

# Field

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ContainerType ContainerType { get; }` | `field.ContainerType` | ContainerType |
| `String Documentation { get; }` | `field.Documentation` | String |
| `String FieldName { get; }` | `field.FieldName` | String |
| `Boolean IsValidObject { get; }` | `field.IsValidObject` | Boolean |
| `Type KeyType { get; }` | `field.KeyType` | Type |
| `Schema Schema { get; }` | `field.Schema` | Schema |
| `Schema SubSchema { get; }` | `field.SubSchema` | Schema |
| `Guid SubSchemaGUID { get; }` | `field.SubSchemaGUID` | Guid |
| `Type ValueType { get; }` | `field.ValueType` | Type |
| `Boolean CompatibleUnit(ForgeTypeId)` | `field.CompatibleUnit(unitTypeId)` | Boolean |
| `Void Dispose()` | `field.Dispose()` | Void |
| `ForgeTypeId GetSpecTypeId()` | `field.GetSpecTypeId()` | ForgeTypeId |
| `Boolean SubEntityReadAccessGranted()` | `field.SubEntityReadAccessGranted()` | Boolean |
| `Boolean SubEntityWriteAccessGranted()` | `field.SubEntityWriteAccessGranted()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```